nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE SFR_TYPE* _SPI_RECEIVE_BUFFER_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_READ_DATA_SIGN_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_ERROR_INTERRUPT_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RX_OVERFLOW_ERROR_INTERRUPT_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TX_UNDERRUN_ERROR_INTERRUPT_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RX_OVERFLOW_AUDIO_ERROR_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TX_UNDERRUN_AUDIO_ERROR_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_AUDIO_PROTOCOL_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_AUDIO_TRANSMIT_MODE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_AUDIO_PROTOCOL_MODE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1CON2;
        case SPI_ID_2 :
            return &SPI2CON2;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_BUFFER_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1BUF;
        case SPI_ID_2 :
            return &SPI2BUF;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_BAUD_RATE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return &SPI1BRG;
        case SPI_ID_2 :
            return &SPI2BRG;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAMED_COMMUNICATION_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_DIRECTION_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMSYNC_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYNC_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_POLARITY_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMPOL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMPOL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_SLAVE_SELECT_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MSSEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MSSEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_WIDTH_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMSYPW_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYPW_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMCNT_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMCNT_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_CLOCK_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MCLKSEL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MCLKSEL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_EDGE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_SPIFE_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SPIFE_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_ENHBUF_MASK;
        case SPI_ID_2 :
            return _SPI2CON_ENHBUF_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_ENABLE_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_ON_MASK;
        case SPI_ID_2 :
            return _SPI2CON_ON_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_STOP_IN_IDLE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_SIDL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SIDL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SDO_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_DISSDO_MASK;
        case SPI_ID_2 :
            return _SPI2CON_DISSDO_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MODE32_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MODE32_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

