nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE SFR_DATA _SPI_RX_OVERFLOW_ERROR_INTERRUPT_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_SPIROVEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_SPIROVEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_UNDERRUN_ERROR_INTERRUPT_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_SPITUREN_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_SPITUREN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_OVERFLOW_AUDIO_ERROR_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_IGNROV_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_IGNROV_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_UNDERRUN_AUDIO_ERROR_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_IGNTUR_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_IGNTUR_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_PROTOCOL_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_AUDEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_TRANSMIT_MODE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDMONO_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_AUDMONO_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_PROTOCOL_MODE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDMOD_MASK;
        case SPI_ID_2 :
            return _SPI2CON2_AUDMOD_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUFFER_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return (SFR_DATA)-1;
        case SPI_ID_2 :
            return (SFR_DATA)-1;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return (SFR_DATA)-1;
        case SPI_ID_2 :
            return (SFR_DATA)-1;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAMED_COMMUNICATION_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_DIRECTION_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMSYNC_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYNC_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_POLARITY_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMPOL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMPOL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_SLAVE_SELECT_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MSSEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MSSEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_WIDTH_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMSYPW_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYPW_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_FRMCNT_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMCNT_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_CLOCK_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MCLKSEL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MCLKSEL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_EDGE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_SPIFE_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SPIFE_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_ENHBUF_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_ENHBUF_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_ENABLE_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_ON_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_ON_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_STOP_IN_IDLE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_SIDL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SIDL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SDO_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_DISSDO_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_DISSDO_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON_MODE32_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MODE32_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

