nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE SFR_DATA _SPI_TX_UNDERRUN_ERROR_INTERRUPT_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_SPITUREN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_SPITUREN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_OVERFLOW_AUDIO_ERROR_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_IGNROV_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_IGNROV_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_UNDERRUN_AUDIO_ERROR_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_IGNTUR_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_IGNTUR_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_PROTOCOL_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDEN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_AUDEN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_TRANSMIT_MODE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDMONO_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_AUDMONO_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_AUDIO_PROTOCOL_MODE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return _SPI1CON2_AUDMOD_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON2_AUDMOD_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUFFER_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case SPI_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case SPI_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/spi_EnableControl_Default.h"
#include "../templates/spi_StopInIdle_Default.h"
#include "../templates/spi_ReceiverOverflow_Default.h"
#include "../templates/spi_TransmitBufferFullStatus_Default.h"
#include "../templates/spi_TransmitBufferEmptyStatus_Default.h"
#include "../templates/spi_ReceiveBufferStatus_Default.h"
#include "../templates/spi_PinControl_PIC32.h"
#include "../templates/spi_CommunicationWidth_PIC32.h"
#include "../templates/spi_AudioCommunicationWidth_PIC32.h"
#include "../templates/spi_InputSamplePhase_Default.h"
#include "../templates/spi_OutputDataPhase_Default.h"
#include "../templates/spi_ClockPolarity_Default.h"
#include "../templates/spi_MasterControl_Default.h"
#include "../templates/spi_BaudRate_Default.h"
#include "../templates/spi_BusStatus_Default.h"
#include "../templates/spi_ReadDataSignStatus_Default.h"
#include "../templates/spi_SlaveSelectControl_Default.h"
#include "../templates/spi_TransmitUnderRunStatus_Default.h"
#include "../templates/spi_FIFOControl_Default.h"
#include "../templates/spi_FIFOCount_PIC32.h"
#include "../templates/spi_ReceiveFIFOStatus_Default.h"
#include "../templates/spi_FIFOShiftRegisterEmptyStatus_Default.h"
#include "../templates/spi_FIFOInterruptMode_PIC32.h"
#include "../templates/spi_FramedCommunication_Default.h"
#include "../templates/spi_FrameSyncPulseDirection_Default.h"
#include "../templates/spi_FrameSyncPulsePolarity_Default.h"
#include "../templates/spi_FrameSyncPulseEdge_Default.h"
#include "../templates/spi_FrameSyncPulseWidth_Default.h"
#include "../templates/spi_FrameSyncPulseCounter_PIC32.h"
#include "../templates/spi_FrameErrorStatus_Default.h"
#include "../templates/spi_Buffer_Default.h"
#include "../templates/spi_BaudRateClock_Default.h"
#include "../templates/spi_ErrorInterruptControl_Default.h"
#include "../templates/spi_AudioErrorControl_Default.h"
#include "../templates/spi_AudioProtocolControl_Default.h"
#include "../templates/spi_AudioTransmitMode_Default.h"
#include "../templates/spi_AudioProtocolMode_Default.h"
#include "../templates/spi_Buffer32bit_Default.h"
#include "../templates/spi_Buffer16bit_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_SPI_Enable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_Enable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_Enable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_Disable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_Disable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_Disable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsEnableControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsEnableControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsEnableControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_StopInIdleEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_StopInIdleEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_StopInIdleEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_StopInIdleDisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_StopInIdleDisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_StopInIdleDisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsStopInIdleControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsStopInIdleControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsStopInIdleControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ReceiverHasOverflowed(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ReceiverHasOverflowed_Default(index);
        case SPI_ID_2 :
            return SPI_ReceiverHasOverflowed_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_ReceiverOverflowClear(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_ReceiverOverflowClear_Default(index);
            break;
        case SPI_ID_2 :
            SPI_ReceiverOverflowClear_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsReceiverOverflow(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsReceiverOverflow_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsReceiverOverflow_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

