nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE_API uint8_t PLIB_SPI_FIFOCountGet(SPI_MODULE_ID index, SPI_FIFO_TYPE type)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_FIFOCountGet_PIC32(index, type);
        case SPI_ID_2 :
            return SPI_FIFOCountGet_PIC32(index, type);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOCount(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFIFOCount_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOCount_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ReceiverFIFOIsEmpty(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ReceiverFIFOIsEmpty_Default(index);
        case SPI_ID_2 :
            return SPI_ReceiverFIFOIsEmpty_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsReceiveFIFOStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsReceiveFIFOStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsReceiveFIFOStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_FIFOShiftRegisterIsEmpty(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_FIFOShiftRegisterIsEmpty_Default(index);
        case SPI_ID_2 :
            return SPI_FIFOShiftRegisterIsEmpty_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOShiftRegisterEmptyStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFIFOShiftRegisterEmptyStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOShiftRegisterEmptyStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FIFOInterruptModeSelect(SPI_MODULE_ID index, SPI_FIFO_INTERRUPT mode)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FIFOInterruptModeSelect_PIC32(index, mode);
            break;
        case SPI_ID_2 :
            SPI_FIFOInterruptModeSelect_PIC32(index, mode);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOInterruptMode(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFIFOInterruptMode_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOInterruptMode_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FramedCommunicationEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FramedCommunicationEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FramedCommunicationEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_FramedCommunicationDisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FramedCommunicationDisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FramedCommunicationDisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFramedCommunication(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFramedCommunication_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFramedCommunication_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseDirectionSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_DIRECTION direction)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameSyncPulseDirectionSelect_Default(index, direction);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseDirectionSelect_Default(index, direction);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseDirection(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameSyncPulseDirection_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseDirection_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulsePolaritySelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_POLARITY polarity)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameSyncPulsePolaritySelect_Default(index, polarity);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulsePolaritySelect_Default(index, polarity);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulsePolarity(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameSyncPulsePolarity_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulsePolarity_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseEdgeSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_EDGE edge)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameSyncPulseEdgeSelect_Default(index, edge);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseEdgeSelect_Default(index, edge);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseEdge(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameSyncPulseEdge_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseEdge_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseWidthSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_WIDTH width)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameSyncPulseWidthSelect_Default(index, width);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseWidthSelect_Default(index, width);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseWidth(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameSyncPulseWidth_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseWidth_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseCounterSelect(SPI_MODULE_ID index, SPI_FRAME_SYNC_PULSE pulse)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameSyncPulseCounterSelect_PIC32(index, pulse);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseCounterSelect_PIC32(index, pulse);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseCounter(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameSyncPulseCounter_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseCounter_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_FrameErrorStatusGet(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_FrameErrorStatusGet_Default(index);
        case SPI_ID_2 :
            return SPI_FrameErrorStatusGet_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

