nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE_API void PLIB_SPI_FrameErrorStatusClear(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_FrameErrorStatusClear_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FrameErrorStatusClear_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameErrorStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsFrameErrorStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameErrorStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BufferClear(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_BufferClear_Default(index);
            break;
        case SPI_ID_2 :
            SPI_BufferClear_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_SPI_BufferRead(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_BufferRead_Default(index);
        case SPI_ID_2 :
            return SPI_BufferRead_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BufferWrite(SPI_MODULE_ID index, uint8_t data)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_BufferWrite_Default(index, data);
            break;
        case SPI_ID_2 :
            SPI_BufferWrite_Default(index, data);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsBuffer(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsBuffer_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsBuffer_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void* PLIB_SPI_BufferAddressGet(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_BufferAddressGet_Default(index);
        case SPI_ID_2 :
            return SPI_BufferAddressGet_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BaudRateClockSelect(SPI_MODULE_ID index, SPI_BAUD_RATE_CLOCK type)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_BaudRateClockSelect_Default(index, type);
            break;
        case SPI_ID_2 :
            SPI_BaudRateClockSelect_Default(index, type);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsBaudRateClock(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsBaudRateClock_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsBaudRateClock_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_ErrorInterruptEnable(SPI_MODULE_ID index, SPI_ERROR_INTERRUPT error)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_ErrorInterruptEnable_Default(index, error);
            break;
        case SPI_ID_2 :
            SPI_ErrorInterruptEnable_Default(index, error);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_ErrorInterruptDisable(SPI_MODULE_ID index, SPI_ERROR_INTERRUPT error)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_ErrorInterruptDisable_Default(index, error);
            break;
        case SPI_ID_2 :
            SPI_ErrorInterruptDisable_Default(index, error);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsErrorInterruptControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsErrorInterruptControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsErrorInterruptControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioErrorEnable(SPI_MODULE_ID index, SPI_AUDIO_ERROR error)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioErrorEnable_Default(index, error);
            break;
        case SPI_ID_2 :
            SPI_AudioErrorEnable_Default(index, error);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioErrorDisable(SPI_MODULE_ID index, SPI_AUDIO_ERROR error)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioErrorDisable_Default(index, error);
            break;
        case SPI_ID_2 :
            SPI_AudioErrorDisable_Default(index, error);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsAudioErrorControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsAudioErrorControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsAudioErrorControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioProtocolEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioProtocolEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_AudioProtocolEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioProtocolDisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioProtocolDisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_AudioProtocolDisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

