nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/spi/processor/spi_p32mx150f128b.h
PLIB_INLINE_API bool PLIB_SPI_ExistsAudioProtocolControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsAudioProtocolControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsAudioProtocolControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioTransmitModeSelect(SPI_MODULE_ID index, SPI_AUDIO_TRANSMIT_MODE mode)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioTransmitModeSelect_Default(index, mode);
            break;
        case SPI_ID_2 :
            SPI_AudioTransmitModeSelect_Default(index, mode);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsAudioTransmitMode(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsAudioTransmitMode_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsAudioTransmitMode_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_AudioProtocolModeSelect(SPI_MODULE_ID index, SPI_AUDIO_PROTOCOL mode)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_AudioProtocolModeSelect_Default(index, mode);
            break;
        case SPI_ID_2 :
            SPI_AudioProtocolModeSelect_Default(index, mode);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsAudioProtocolMode(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_ExistsAudioProtocolMode_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsAudioProtocolMode_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_SPI_BufferRead32bit(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_BufferRead32bit_Default(index);
        case SPI_ID_2 :
            return SPI_BufferRead32bit_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BufferWrite32bit(SPI_MODULE_ID index, uint32_t data)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_BufferWrite32bit_Default(index, data);
            break;
        case SPI_ID_2 :
            SPI_BufferWrite32bit_Default(index, data);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_Exists32bitBuffer(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_Exists32bitBuffer_Default(index);
        case SPI_ID_2 :
            return SPI_Exists32bitBuffer_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint16_t PLIB_SPI_BufferRead16bit(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_BufferRead16bit_Default(index);
        case SPI_ID_2 :
            return SPI_BufferRead16bit_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BufferWrite16bit(SPI_MODULE_ID index, uint16_t data)
{
    switch (index) {
        case SPI_ID_1 :
            SPI_BufferWrite16bit_Default(index, data);
            break;
        case SPI_ID_2 :
            SPI_BufferWrite16bit_Default(index, data);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_Exists16bitBuffer(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_1 :
            return SPI_Exists16bitBuffer_Default(index);
        case SPI_ID_2 :
            return SPI_Exists16bitBuffer_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
